; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-3-17)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city2)
	(fuel-level plane1 fl1)
	(at plane2 city0)
	(fuel-level plane2 fl4)
	(at plane3 city9)
	(fuel-level plane3 fl4)
	(at person1 city4)
	(at person2 city4)
	(at person3 city0)
	(at person4 city0)
	(at person5 city3)
	(at person6 city7)
	(at person7 city4)
	(at person8 city4)
	(at person9 city3)
	(at person10 city0)
	(at person11 city9)
	(at person12 city5)
	(at person13 city0)
	(at person14 city3)
	(at person15 city5)
	(at person16 city5)
	(at person17 city4)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane1 city1)
	(at plane3 city0)
	(at person1 city5)
	(at person2 city4)
	(at person3 city8)
	(at person4 city5)
	(at person5 city3)
	(at person6 city4)
	(at person7 city9)
	(at person8 city6)
	(at person9 city1)
	(at person10 city8)
	(at person11 city3)
	(at person12 city7)
	(at person13 city7)
	(at person14 city8)
	(at person15 city1)
	(at person16 city8)
	(at person17 city3)
	))

)

; plan
1. (zoom plane3 city9 city3 fl4 fl3 fl2)
   deleted: (at plane3 city9) (fuel-level plane3 fl4)
   added: (at plane3 city3) (fuel-level plane3 fl2)
   goals met: 2 of 19
2. (board person9 plane3 city3)
   deleted: (at person9 city3)
   added: (in person9 plane3)
   goals met: 2 of 19
3. (board person14 plane3 city3)
   deleted: (at person14 city3)
   added: (in person14 plane3)
   goals met: 2 of 19
4. (board person4 plane2 city0)
   deleted: (at person4 city0)
   added: (in person4 plane2)
   goals met: 2 of 19
5. (zoom plane2 city0 city5 fl4 fl3 fl2)
   deleted: (at plane2 city0) (fuel-level plane2 fl4)
   added: (at plane2 city5) (fuel-level plane2 fl2)
   goals met: 2 of 19
6. (debark person4 plane2 city5)
   deleted: (in person4 plane2)
   added: (at person4 city5)
   goals met: 3 of 19
7. (board person16 plane2 city5)
   deleted: (at person16 city5)
   added: (in person16 plane2)
   goals met: 3 of 19
8. (board person15 plane2 city5)
   deleted: (at person15 city5)
   added: (in person15 plane2)
   goals met: 3 of 19
9. (board person12 plane2 city5)
   deleted: (at person12 city5)
   added: (in person12 plane2)
   goals met: 3 of 19
10. (fly plane1 city2 city1 fl1 fl0)
   deleted: (at plane1 city2) (fuel-level plane1 fl1)
   added: (at plane1 city1) (fuel-level plane1 fl0)
   goals met: 4 of 19
11. (zoom plane3 city3 city0 fl2 fl1 fl0)
   deleted: (at plane3 city3) (fuel-level plane3 fl2)
   added: (at plane3 city0) (fuel-level plane3 fl0)
   goals met: 5 of 19
12. (refuel plane3 city0 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 5 of 19
13. (board person3 plane3 city0)
   deleted: (at person3 city0)
   added: (in person3 plane3)
   goals met: 5 of 19
14. (board person13 plane3 city0)
   deleted: (at person13 city0)
   added: (in person13 plane3)
   goals met: 5 of 19
15. (board person10 plane3 city0)
   deleted: (at person10 city0)
   added: (in person10 plane3)
   goals met: 5 of 19
16. (fly plane3 city0 city8 fl1 fl0)
   deleted: (at plane3 city0) (fuel-level plane3 fl1)
   added: (at plane3 city8) (fuel-level plane3 fl0)
   goals met: 4 of 19
17. (refuel plane3 city8 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 4 of 19
18. (debark person3 plane3 city8)
   deleted: (in person3 plane3)
   added: (at person3 city8)
   goals met: 5 of 19
19. (debark person14 plane3 city8)
   deleted: (in person14 plane3)
   added: (at person14 city8)
   goals met: 6 of 19
20. (debark person10 plane3 city8)
   deleted: (in person10 plane3)
   added: (at person10 city8)
   goals met: 7 of 19
21. (fly plane3 city8 city0 fl1 fl0)
   deleted: (at plane3 city8) (fuel-level plane3 fl1)
   added: (at plane3 city0) (fuel-level plane3 fl0)
   goals met: 8 of 19
22. (refuel plane3 city0 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 8 of 19
23. (zoom plane2 city5 city1 fl2 fl1 fl0)
   deleted: (at plane2 city5) (fuel-level plane2 fl2)
   added: (at plane2 city1) (fuel-level plane2 fl0)
   goals met: 8 of 19
24. (refuel plane2 city1 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 8 of 19
25. (debark person15 plane2 city1)
   deleted: (in person15 plane2)
   added: (at person15 city1)
   goals met: 9 of 19
26. (fly plane2 city1 city7 fl1 fl0)
   deleted: (at plane2 city1) (fuel-level plane2 fl1)
   added: (at plane2 city7) (fuel-level plane2 fl0)
   goals met: 9 of 19
27. (refuel plane2 city7 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 9 of 19
28. (board person6 plane2 city7)
   deleted: (at person6 city7)
   added: (in person6 plane2)
   goals met: 9 of 19
29. (debark person12 plane2 city7)
   deleted: (in person12 plane2)
   added: (at person12 city7)
   goals met: 10 of 19
30. (fly plane2 city7 city4 fl1 fl0)
   deleted: (at plane2 city7) (fuel-level plane2 fl1)
   added: (at plane2 city4) (fuel-level plane2 fl0)
   goals met: 10 of 19
31. (refuel plane2 city4 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 10 of 19
32. (board person8 plane2 city4)
   deleted: (at person8 city4)
   added: (in person8 plane2)
   goals met: 10 of 19
33. (board person7 plane2 city4)
   deleted: (at person7 city4)
   added: (in person7 plane2)
   goals met: 10 of 19
34. (debark person6 plane2 city4)
   deleted: (in person6 plane2)
   added: (at person6 city4)
   goals met: 11 of 19
35. (board person17 plane2 city4)
   deleted: (at person17 city4)
   added: (in person17 plane2)
   goals met: 11 of 19
36. (board person1 plane2 city4)
   deleted: (at person1 city4)
   added: (in person1 plane2)
   goals met: 11 of 19
37. (fly plane3 city0 city1 fl1 fl0)
   deleted: (at plane3 city0) (fuel-level plane3 fl1)
   added: (at plane3 city1) (fuel-level plane3 fl0)
   goals met: 10 of 19
38. (refuel plane3 city1 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 10 of 19
39. (debark person9 plane3 city1)
   deleted: (in person9 plane3)
   added: (at person9 city1)
   goals met: 11 of 19
40. (fly plane3 city1 city7 fl1 fl0)
   deleted: (at plane3 city1) (fuel-level plane3 fl1)
   added: (at plane3 city7) (fuel-level plane3 fl0)
   goals met: 11 of 19
41. (refuel plane3 city7 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 11 of 19
42. (debark person13 plane3 city7)
   deleted: (in person13 plane3)
   added: (at person13 city7)
   goals met: 12 of 19
43. (fly plane3 city7 city9 fl1 fl0)
   deleted: (at plane3 city7) (fuel-level plane3 fl1)
   added: (at plane3 city9) (fuel-level plane3 fl0)
   goals met: 12 of 19
44. (refuel plane3 city9 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 12 of 19
45. (board person11 plane3 city9)
   deleted: (at person11 city9)
   added: (in person11 plane3)
   goals met: 12 of 19
46. (fly plane3 city9 city3 fl1 fl0)
   deleted: (at plane3 city9) (fuel-level plane3 fl1)
   added: (at plane3 city3) (fuel-level plane3 fl0)
   goals met: 12 of 19
47. (refuel plane3 city3 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 12 of 19
48. (debark person11 plane3 city3)
   deleted: (in person11 plane3)
   added: (at person11 city3)
   goals met: 13 of 19
49. (fly plane3 city3 city0 fl1 fl0)
   deleted: (at plane3 city3) (fuel-level plane3 fl1)
   added: (at plane3 city0) (fuel-level plane3 fl0)
   goals met: 14 of 19
50. (fly plane2 city4 city3 fl1 fl0)
   deleted: (at plane2 city4) (fuel-level plane2 fl1)
   added: (at plane2 city3) (fuel-level plane2 fl0)
   goals met: 14 of 19
51. (refuel plane2 city3 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 14 of 19
52. (debark person17 plane2 city3)
   deleted: (in person17 plane2)
   added: (at person17 city3)
   goals met: 15 of 19
53. (fly plane2 city3 city5 fl1 fl0)
   deleted: (at plane2 city3) (fuel-level plane2 fl1)
   added: (at plane2 city5) (fuel-level plane2 fl0)
   goals met: 15 of 19
54. (refuel plane2 city5 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 15 of 19
55. (debark person1 plane2 city5)
   deleted: (in person1 plane2)
   added: (at person1 city5)
   goals met: 16 of 19
56. (fly plane2 city5 city6 fl1 fl0)
   deleted: (at plane2 city5) (fuel-level plane2 fl1)
   added: (at plane2 city6) (fuel-level plane2 fl0)
   goals met: 16 of 19
57. (refuel plane2 city6 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 16 of 19
58. (debark person8 plane2 city6)
   deleted: (in person8 plane2)
   added: (at person8 city6)
   goals met: 17 of 19
59. (fly plane2 city6 city8 fl1 fl0)
   deleted: (at plane2 city6) (fuel-level plane2 fl1)
   added: (at plane2 city8) (fuel-level plane2 fl0)
   goals met: 17 of 19
60. (refuel plane2 city8 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 17 of 19
61. (debark person16 plane2 city8)
   deleted: (in person16 plane2)
   added: (at person16 city8)
   goals met: 18 of 19
62. (fly plane2 city8 city9 fl1 fl0)
   deleted: (at plane2 city8) (fuel-level plane2 fl1)
   added: (at plane2 city9) (fuel-level plane2 fl0)
   goals met: 18 of 19
63. (debark person7 plane2 city9)
   deleted: (in person7 plane2)
   added: (at person7 city9)
   goals met: 19 of 19
